{
  "education": [
    {
      "awards_achievements": [
        "GPA 3.5/4.0"
      ],
      "degree": "Bachelor of Applied Sciences, Computer Engineering",
      "department": "Department Engineering and Applied Sciences",
      "duration": "2017-2022",
      "school_name": "Memorial University of Newfoundland"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_DevinSmith",
  "highlighted_projects": [
    {
      "description": "Assisted in the development of the communications subsystem on the Killick-1 sea ice measurement satellite, using C.",
      "git_url": "https://github.com/jarviscanada/jarvis_profile_builder",
      "name": "Communication Subsystem for the Killick-1 Satallite"
    }
  ],
  "jarvis_projects": [
    {
      "description": "The Cluster Monitor project measures resource usage by different nodes connected within a Linux Cluster. This was done using Docker to containerize a PostgreSQL instance, and bash scripts which were used to automate data collection into the databases tables using crontab.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "JDBC App: The JBDC app is a java app built with maven and designed to emulate a stock trade wallet with the ability to check stocks and emulate buying and selling them. It connects with an API endpoint using the OKHTTP library, and collects stock quote data. It is parsed using the Jackson databind library and the data is stored in a Postgresql server. It is dockerized for deployment ease, and features a text based user interface.",
        "Grep App: In this project, the goal was to develop an app that operates similar to the grep command line utility using core java. This means that it takes in some text and searches a file or files and checks the text to see if there are instances of that text within the referenced file. This project used core java, and the following libraries; java.util for List, ArrayList and regex.Pattern, java.io for FileWriter, FileReader, BufferedReader, BufferedWriter and IOException. It also used org.slf4j for Logger and LoggerFactory. Maven was used to compile the project and to pull the libraries, and it was written within VSCode. It was then made into a Docker image for deployment."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Devin Smith",
  "others": [
    {
      "bullets": [
        "Chess and other strategy games hobbyist",
        "Build and and paint model kits",
        "Volunteered with Cumberland Youth Intervention Program"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Avazz",
      "description": "Developed a frontend for an AI chat app, trained an LLM model, deployed it on a cloud solution",
      "duration": "2023-present",
      "title": "Fullstack Developer/R\u0026D"
    },
    {
      "company": "Jarvis",
      "description": "Developed an app for measuring resource usage by nodes in a Linux Cluster using Docker, PostgreSQL, and Bash commands. Working on a SQL project currently.",
      "duration": "2023-present",
      "title": "Software Developer"
    },
    {
      "company": "C-Core",
      "description": "Created and tested VHDL code for the Killick-1 satellites sea ice measurement technique, 'Delayed Doppler Imaging'. Joined daily scrums and weekly full team meetings.",
      "duration": "September 2021 - December 2021",
      "title": "Research \u0026 Development"
    },
    {
      "company": "Innovative Development \u0026 Design Engineers Ltd. Newfoundland",
      "description": "Created an online form generation tool using Python and Angular. Created a testing GUI using the TKinter. Created an applet to connect to the Google Maps API for measuring property boundaries ",
      "duration": "2020",
      "title": "Full Stack Developer"
    }
  ],
  "skills": {
    "competent": [
      "RDBMS/SQL",
      "C/C++",
      "VHDL",
      "Angular",
      "Docker"
    ],
    "familiar": [
      "Springboot",
      "MacOS",
      "Windows",
      "Javascript",
      "ferm"
    ],
    "proficient": [
      "Java",
      "Python",
      "Linux/Bash",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "Greetings, my name is Devin Smith and I am a recent graduate from Memorial University of Newfoundlands Computer Engineering program. I have always been interested in technology, starting with video games as a child. I have since gained interest in 3D modeling, statistical modeling and AI applications. I am a fan of competitive games, and enjoy game theory. My other hobbies include model building, and tabletop games, like Mahjong."
}
